bierner.markdown-preview-github-styles
clinyong.vscode-css-modules
csstools.postcss
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
firefox-devtools.vscode-firefox-debug
GitHub.codespaces
GitHub.vscode-pull-request-github
golang.go
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
hashicorp.terraform
letrieu.expand-region
mongodb.mongodb-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
redhat.vscode-xml
redhat.vscode-yaml
ryu1kn.partial-diff
Shopify.theme-check-vscode
stkb.rewrap
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
