bierner.markdown-preview-github-styles
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
figma.figma-vscode-extension
firefox-devtools.vscode-firefox-debug
GitHub.codespaces
GitHub.copilot
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
hashicorp.terraform
letrieu.expand-region
mechatroner.rainbow-csv
mongodb.mongodb-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.autopep8
ms-python.black-formatter
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.live-server
ms-vscode.makefile-tools
pranaygp.vscode-css-peek
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
ryu1kn.partial-diff
stkb.rewrap
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
svelte.svelte-vscode
vunguyentuan.vscode-postcss
