astro-build.astro-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
chunsen.bracket-select
clinyong.vscode-css-modules
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
equinusocio.vsc-material-theme
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
github.codespaces
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
henriiik.vscode-sort
mechatroner.rainbow-csv
mongodb.mongodb-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
ryu1kn.partial-diff
stkb.rewrap
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
svelte.svelte-vscode
tamasfe.even-better-toml
