tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "powershell/tap"
tap "shopify/shopify"
brew "age"
brew "brotli"
brew "webp"
brew "asdf"
brew "c-ares"
brew "ca-certificates"
brew "openssl@3"
brew "certbot"
brew "cloc"
brew "colima"
brew "curl"
brew "libusb"
brew "dfu-util"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "erlang"
brew "ffmpeg"
brew "fonttools"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "glances"
brew "unbound"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "icu4c@76"
brew "imagemagick"
brew "oniguruma"
brew "jq"
brew "openjdk"
brew "ktlint"
brew "kubernetes-cli"
brew "libarchive"
brew "libass"
brew "mas"
brew "minikube"
brew "mkcert"
brew "node"
brew "mongosh"
brew "nmap"
brew "openblas"
brew "pipenv"
brew "pkgconf"
brew "pngquant"
brew "postgresql@14"
brew "pre-commit"
brew "pure"
brew "python@3.11"
brew "qemu"
brew "rclone"
brew "sops"
brew "svgo"
brew "swiftlint"
brew "tesseract"
brew "tree"
brew "uv"
brew "wget"
brew "woff2"
brew "getsentry/tools/sentry-cli"
brew "mongodb/brew/mongodb-database-tools"
cask "blender"
cask "claude"
cask "claude-code"
cask "discord"
cask "figma"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "logi-options+"
cask "musescore"
cask "ngrok"
cask "notion"
cask "philips-hue-sync"
cask "postman"
cask "protonvpn"
cask "prusaslicer"
cask "qmk-toolbox"
cask "rectangle-pro"
cask "sf-symbols"
cask "visual-studio-code"
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Bitwarden", id: 1352778147
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Kaleidoscope", id: 1575557335
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "chunsen.bracket-select"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ryu1kn.partial-diff"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
cargo "avm"
