tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "ngrok/ngrok"
tap "shopify/shopify"
brew "act"
brew "age"
brew "brotli"
brew "webp"
brew "ca-certificates"
brew "asdf"
brew "c-ares"
brew "certbot"
brew "cloc"
brew "unbound"
brew "libusb"
brew "colima"
brew "curl"
brew "dfu-util"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "doctl"
brew "erlang"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "openblas"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "glances"
brew "graphviz"
brew "node"
brew "http-server"
brew "oniguruma"
brew "jq"
brew "just"
brew "kubernetes-cli"
brew "lftp"
brew "mas"
brew "minikube"
brew "mkcert"
brew "mongosh"
brew "nmap"
brew "openjdk"
brew "pipenv"
brew "postgresql@14"
brew "pre-commit"
brew "pure"
brew "python@3.11"
brew "ruby-build"
brew "sonar-scanner"
brew "sops"
brew "tree"
brew "wget"
brew "getsentry/tools/sentry-cli"
cask "blender"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "iterm2"
cask "logi-options-plus"
cask "musescore"
cask "ngrok"
cask "notion"
cask "philips-hue-sync"
cask "postman"
cask "prusaslicer"
cask "qmk-toolbox"
cask "rectangle-pro"
cask "tor-browser"
cask "transmit"
cask "visual-studio-code"
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Kaleidoscope", id: 1575557335
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "‎WhatsApp", id: 310633997
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "chunsen.bracket-select"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "henriiik.vscode-sort"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vunguyentuan.vscode-postcss"
